''' Напишите программу, которая принимает на вход координаты точки (X и Y),
причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка
(или на какой оси она находится).
*Пример:*
- x=34; y=-30 -> 4
- x=2; y=4-> 1
- x=-34; y=-30 -> 3
 '''
x = int(input('введите координату x '))
y = int(input('введите координату y '))
def func(a,b):
    if a == 0 or b == 0:
        print('ошибка')
    elif a>0 and b>0:
        print('1 четверть')
    elif a<0 and b>0:
        print('2 четверть')
    elif a<0 and b<0:
        print('3 четверть')
    else:
        print('4 четверть')
func(x,y)
